data/tests/echo/rust_tokio_250_1.txt
Run 1:
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 64.23.188.215 (be patient)


Server Software:        
Server Hostname:        64.23.188.215
Server Port:            4221

Document Path:          /echo/hello
Document Length:        5 bytes

Concurrency Level:      250
Time taken for tests:   20.225 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      800000 bytes
HTML transferred:       50000 bytes
Requests per second:    494.44 [#/sec] (mean)
Time per request:       505.619 [ms] (mean)
Time per request:       2.022 [ms] (mean, across all concurrent requests)
Transfer rate:          38.63 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       21  247 461.4     92    7139
Processing:    29  177 330.5     96    8389
Waiting:       19  175 328.0     96    8389
Total:         50  423 579.1    196    8464

Percentage of the requests served within a certain time (ms)
  50%    196
  66%    239
  75%    336
  80%    444
  90%   1178
  95%   1402
  98%   2214
  99%   2786
 100%   8464 (longest request)